Tekla Open API Reference for Tekla Structures 2025
Events.DrawingUpdateTypeEnum Enumeration
 The types of drawing update event.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DrawingUpdateTypeEnum
Public Enumeration DrawingUpdateTypeEnum
Members
Member name | Value | Description
INSERTED | 0 |  Drawing created
MODIFIED | 1 |  Drawing modified
DELETED | 2 |  Drawing deleted
See Also
Reference
Tekla.Structures.Drawing Namespace